app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (("movies"."rating" IN ('G', 'R', 'PG-13', 'PG') OR "movies"."rating" IS NULL))
---
  def index
	#session.delete(:sort)
	#session.delete(:ratings)
	@all_ratings = Movie.ratings
	@title_header = ""
	@release_date_header = ""

	@sort_by = params[:sort] || session[:sort] || ""
	@rating_list = params[:ratings] || session[:ratings] || {}

	if(@rating_list.empty?)
		@rating_list = @all_ratings
	end
	@rating_list.each {|k,v| @all_ratings[k] = true }

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "release_date" = '1993-11-25 00:00:00.000000', "updated_at" = '2013-02-25 08:02:30.384827' WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])